In [1]:
import pandas as pd
import numpy as np

In [2]:
data = pd.read_csv(r'employees.csv')
data

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [9]:
print(f"type: {type(data)}")

type: <class 'pandas.core.frame.DataFrame'>

In [10]:
data.columns

Index(['First Name', 'Gender', 'Start Date', 'Last Login Time', 'Salary',
       'Bonus %', 'Senior Management', 'Team'],
      dtype='object')

In [14]:
money = data['Salary']
money

0       97308
1       61933
2      130590
3      138705
4      101004
        ...
995    132483
996     42392
997     96914
998     60500
999    129949
Name: Salary, Length: 1000, dtype: int64

In [23]:
# convert data in Salary column into array

salary = np.array(data[['Salary', 'Bonus %']])
print(f"{salary}, size: {np.shape(salary)}, type: {type(salary)}")

[[9.73080e+04 6.94500e+00]
 [6.19330e+04 4.17000e+00]
 [1.30590e+05 1.18580e+01]
 ...
 [9.69140e+04 1.42100e+00]
 [6.05000e+04 1.19850e+01]
 [1.29949e+05 1.01690e+01]], size: (1000, 2), type: <class 'numpy.ndarray'>

In [22]:
# to convert data in 'Salary' into array second method

salary1 = data['Salary'].values
salary1

array([ 97308,  61933, 130590, 138705, 101004, 115163,  65476,  45906,
        95570, 139852,  63241, 102508, 112807, 109831,  41426,  59414,
        90370, 111737, 132940,  81014,  64714, 100612,  90816, 125792,
        97950,  37076,  37598, 122367, 124008,  79529, 118780,  88657,
       122340, 119082,  95734,  85182, 142032,  57427,  36844, 122173,
        99283,  66582, 121918,  73524, 145146,  88010, 114796,  66820,
        93581, 113590,  94976,  41126,  49339,  40341,  83677, 102488,
       130276,  64715,  72670,  66851,  48866, 106862,  58112,  35203,
        77834,  61310, 125250,  51178,  84834, 100863,  84692, 118172,
        54043,  90582,  62096, 104897, 131604, 107391, 114797, 115814,
       137126,  47369,  35095, 148115,  83072, 100238, 103495, 144887,
        64088,  51082,  91719, 128771, 119009, 111858, 130620,  43026,
       142321, 140371, 100705,  77544,  48109,  61602, 103902, 136984,
        80740,  91712,  42146,  68680, 133980,  37919, 147113,  42153,
        64363, 114767,  58698,  54585,  76189, 109095, 120204,  41054,
        84885, 119735, 110169,  73789,  76078,  49368,  57325,  66521,
       127654,  60866,  41334,  94231, 146670, 106317, 109260, 134148,
        43542,  95327, 112238, 132373, 113850, 110194, 146129, 140013,
       122717,  71715,  95322,  89227, 124488,  86230, 135490, 121333,
       129297,  84546,  85730, 104058, 105062,  79536, 114412,  68501,
       149563, 103386,  89786,  52226, 134645,  59148,  42341, 142178,
        38989,  53754, 133772, 143499,  97058,  85446,  40297, 146651,
       124486, 102652, 144474,  68759,  57286,  58129, 123940,  98233,
       140810,  42090, 149654,  51430,  71749,  85700,  57783,  36946,
        99326, 109259, 131038, 121068,  62719,  69268,  36067, 130581,
        89661,  36643, 140558, 103521,  55281, 115711, 114079,  57531,
       141069,  89434,  44639, 110967, 115387,  81673, 109588,  92544,
       142373,  83341,  98865, 120444,  71945, 109564,  78417, 106947,
        87298,  64579,  50905,  59728,  51685,  49542,  38375,  64084,
       147663,  73935,  40837,  94393,  42087,  52080,  35061,  64164,
        94088, 127813,  38041, 126310, 142561,  70817,  59937, 106115,
        82782, 104896, 133943,  83658,  71896, 113732, 110485, 115118,
        48696,  42676,  43586,  89258,  90730, 100308,  69134,  58295,
        50141, 101941, 115145,  40451,  56526, 145316, 103235,  58563,
        74129,  74669,  97490, 104250,  94345,  82439,  51613, 105946,
        46080, 134610, 125104, 107281, 141521,  65931,  69989, 147183,
        66757,  75145, 129460, 132839,  44537, 118733,  46905,  79582,
        55394, 123811, 137314,  36711, 111786,  72257,  71276,  38712,
        46930, 125220, 121477,  86386,  81308,  84810,  66775,  72145,
       121604, 109510, 112117, 108127, 123711, 132381, 148225, 145988,
        62960,  56926,  41428, 115658,  76707,  60388,  45150,  58755,
        76076,  87760, 135119,  36759, 121723, 110061,  85074,  85799,
        75150,  91344,  86326,  98753, 113060,  77327,  62666,  96633,
        58248,  83706,  74086,  95389, 129968, 140347,  41549,  74287,
        69906,  65078, 106406, 115913,  38092, 121160,  90429,  64207,
        80688,  55044,  72893,  96978,  97364, 140885,  58520,  66067,
       147183,  87721, 144001,  91133,  67827,  81839,  81444, 137661,
       112548, 111249, 114334, 118906,  72979,  64172, 107024,  50167,
       106995,  70492, 125881, 123294, 131045,  97635,  94493, 140502,
       106310,  46240, 111163,  93753,  63494, 116693,  85215,  86439,
        62913,  38872, 124655, 113506, 109980,  91522,  42214,  83159,
       144082,  47885, 126232, 134598,  66604, 115194,  49101,  67811,
       111043,  37748,  36403, 140136, 121508,  79906, 123144,  46953,
        79443,  51395, 134408,  71853,  68028, 149903,  79123, 104014,
       121160,  65362,  50701, 144709,  53061,  36697,  69244, 101036,
        52119,  46666,  73437,  86318,  76409,  71642,  67150, 142208,
        81183, 107163,  55038, 140002, 146812,  40119, 136602,  69579,
       101457, 121232, 102626, 137171,  88276,  43354, 125556,  59862,
        74640,  52875,  58789, 122897, 136032, 141958, 139917, 147635,
        68230, 124365, 104749, 122121, 143541, 137840,  73354,  47647,
       106249,  93847, 104815, 115436,  50645, 142415,  37984,  71751,
       135882,  46007, 117055,  58478, 121357,  44857,  47322,  81077,
        76394, 114356,  41831,  90187,  72613,  42748,  37259, 125033,
        38275,  71520, 106472, 103684,  96111,  90719, 140303,  62161,
        78883,  63549,  63888,  97370,  66224,  97915,  86883,  37812,
        56580,  83895,  58047, 124889, 118840,  67780, 144677,  45724,
        86676,  82401,  35575, 123649,  38078,  52620, 133366,  91462,
       146589,  51633,  45181,  62454,  84746, 147362,  80803, 117293,
       105689,  93302, 102555,  51525,  41190,  75484,  82726, 122319,
       127297, 109290,  99150,  71930,  66819,  42424,  51431, 120675,
        96610,  71430,  87713,  86723,  43414,  87145,  91124,  48141,
        90829, 101262,  41427,  56993, 114244,  81800, 118736,  66077,
        35013,  98393, 107111,  65673,  65482,  81919,  59277,  49501,
        70367, 132156,  56961,  98841,  78226, 116931,  87575, 110924,
        78351, 125574,  95198, 121006,  95728,  69740,  91996,  98385,
        90556,  50366,  84232, 100888, 141335,  97691,  47266, 139754,
       116236, 103405,  41453,  52730,  60361,  63103,  65168,  73105,
        37916,  45682,  69297,  59070,  81215, 128036,  89780, 125018,
       133033,  82408, 131755, 128305, 147309,  74911,  47079,  82873,
       134673, 123591,  75598,  89831,  92430, 126956, 112467,  46665,
        42553, 102081, 135118,  71975, 149908,  45418,  79145, 122920,
       128031,  59969,  35381, 113129, 141932,  42296,  63395, 125382,
       113592,  46750,  90285,  53692, 100341, 123876,  41643, 113760,
        49473, 146141,  79459, 104496,  67789,  86564, 135758,  84672,
       111580,  50455,  88733, 130577, 138925,  62371,  87715,  66029,
        86818,  75147, 105573,  41230, 117787,  88086,  91462, 139959,
        93901,  50529, 134988, 120941, 118753,  92799,  85718, 109517,
        85550, 136655,  43312, 102839,  78891,  93201,  84693,  73587,
        65251, 129148, 128175,  75825,  51821,  60411,  58327,  46478,
       123963,  79796,  83809,  77933,  51070,  97480,  58357,  67165,
       145988, 147417,  95003, 144187,  37888, 131513,  77287,  46875,
        82744,  43252,  66047, 118431,  59943, 136681, 138807,  82884,
        48668, 122971, 107050, 138598, 149456, 128540,  61117, 100949,
        46829,  69111,  46602,  61181,  94963,  85789, 145274, 102841,
        49665,  41928, 128042,  86150, 121816, 123409,  98295,  59678,
        57871, 132084,  35633, 125298, 115582, 148339, 112975,  36927,
        70248, 141305,  72002, 102577, 113554,  47176, 106428,  75181,
        79047,  52970, 137979, 114360, 110306,  46378,  74104, 132505,
        96649,  57811, 111468, 141498, 124441,  40121, 129712, 126010,
       122762, 149105,  44021,  42025,  59970, 145001, 102589,  47529,
       148941,  91109,  51923,  53954,  39335, 111371,  86676, 115057,
       145357,  36749,  89854, 134048, 141311, 123621,  54941, 106562,
        39371,  83112,  96941,  47232,  54058,  80399, 118043, 109411,
        97566,  69267,  87103,  98811, 149684,  71383,  81206,  69112,
       120672,  96511,  49325, 132175, 118037, 139570, 115280,  51065,
       103854,  48354, 132327, 106362, 148857, 131131, 129663,  41449,
        93368,  53335, 148291, 147842, 105066, 139284,  63046,  89700,
       108946,  98406, 108581,  41808,  36837, 140850,  50426, 134120,
        57292,  80633, 131943,  48046,  97443, 135352, 107816,  96329,
        73749,  75607,  98858,  76485,  41238, 114896, 125418,  75415,
        90998, 142868, 135990,  57300,  73706,  85871,  96795,  92242,
       115149, 126924, 145329,  92587,  60263,  91406,  37005, 139791,
        45267,  95296,  59680, 144701,  35477, 119266, 103877,  47605,
       136604, 121250,  35884, 137144, 102697,  61999,  45223,  54033,
       126120,  99747,  71958, 115566, 118369,  51667,  85858, 131423,
        49538,  50369,  86615, 135369,  60003,  95866, 109324, 103557,
       111376,  75661,  85213, 140444,  90427, 141439,  43694, 131952,
        96250,  63126,  44836,  70635, 137386, 104840,  75498,  67471,
       101914,  93712, 133472, 107351, 142410,  37385,  58423, 143638,
       113425,  57266, 119667, 127118,  80838,  70990,  39833,  45094,
        93997, 103050, 121797,  89443,  35802,  68164,  93022, 105681,
        43050,  44486,  63571,  75423,  76381, 137359,  67656,  92436,
       137954, 124566,  66146, 142935,  46233, 148985,  91411, 146907,
        43455,  85668,  82871, 136709,  47638,  38344, 100765, 134505,
       112769,  56450,  98874, 132483,  42392,  96914,  60500, 129949],
      dtype=int64)

In [24]:
data.head(10)  # print first 10 rows

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
0,Douglas,Male,8/6/1993,12:42 PM,97308,6.945,True,Marketing
1,Thomas,Male,3/31/1996,6:53 AM,61933,4.170,True,NaN
2,Maria,Female,4/23/1993,11:17 AM,130590,11.858,False,Finance
3,Jerry,Male,3/4/2005,1:00 PM,138705,9.340,True,Finance
4,Larry,Male,1/24/1998,4:47 PM,101004,1.389,True,Client Services
5,Dennis,Male,4/18/1987,1:35 AM,115163,10.125,False,Legal
6,Ruby,Female,8/17/1987,4:20 PM,65476,10.012,True,Product
7,NaN,Female,7/20/2015,10:43 AM,45906,11.598,NaN,Finance
8,Angela,Female,11/22/2005,6:29 AM,95570,18.523,True,Engineering
9,Frances,Female,8/8/2002,6:51 AM,139852,7.524,True,Business Development

In [25]:
data.tail(6)  # print last 6 rows

,First Name,Gender,Start Date,Last Login Time,Salary,Bonus %,Senior Management,Team
994,George,Male,6/21/2013,5:47 PM,98874,4.479,True,Marketing
995,Henry,NaN,11/23/2014,6:09 AM,132483,16.655,False,Distribution
996,Phillip,Male,1/31/1984,6:30 AM,42392,19.675,False,Finance
997,Russell,Male,5/20/2013,12:39 PM,96914,1.421,False,Product
998,Larry,Male,4/20/2013,4:45 PM,60500,11.985,False,Business Development
999,Albert,Male,5/15/2012,6:24 PM,129949,10.169,True,Sales

In [40]:
# rename column

data = data.rename(columns={'Bonus %': 'Bonus', 'Last Login Time': 'last login'})
data.columns

Index(['First Name', 'Gender', 'Start Date', 'Last Login', 'Salary', 'Bonus',
       'Senior Management', 'Team'],
      dtype='object')

In [32]:
# to check number of entries in a particular column

lt = data['Gender'].value_counts()
lt

Gender
Female    431
Male      424
Name: count, dtype: int64

In [33]:
team_count = data['Team'].value_counts()
team_count

Team
Client Services         106
Finance                 102
Business Development    101
Marketing                98
Product                  95
Sales                    94
Engineering              92
Human Resources          91
Distribution             90
Legal                    88
Name: count, dtype: int64

In [34]:
# to get complete info. about data set

data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   object
 3   Last Login         1000 non-null   object
 4   Salary             1000 non-null   int64
 5   Bonus              1000 non-null   float64
 6   Senior Management  933 non-null    object
 7   Team               957 non-null    object
dtypes: float64(1), int64(1), object(6)
memory usage: 62.6+ KB

In [35]:
data.describe()

              Salary        Bonus
count    1000.000000  1000.000000
mean    90662.181000    10.207555
std     32923.693342     5.528481
min     35013.000000     1.015000
25%     62613.000000     5.401750
50%     90428.000000     9.838500
75%    118740.250000    14.838000
max    149908.000000    19.944000

In [41]:
# to convert data type of column

data['Senior Management'] = data['Senior Management'].astype("bool")
data['Start Date'] = pd.to_datetime(data['Start Date'])
data['Last Login'] = pd.to_datetime(data['Last Login'])
data.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1000 entries, 0 to 999
Data columns (total 8 columns):
 #   Column             Non-Null Count  Dtype
---  ------             --------------  -----
 0   First Name         933 non-null    object
 1   Gender             855 non-null    object
 2   Start Date         1000 non-null   datetime64[ns]
 3   Last Login         1000 non-null   datetime64[ns]
 4   Salary             1000 non-null   int64
 5   Bonus              1000 non-null   float64
 6   Senior Management  1000 non-null   bool
 7   Team               957 non-null    object
dtypes: bool(1), datetime64[ns](2), float64(1), int64(1), object(3)
memory usage: 55.8+ KB

In [42]:
# to count number of null in data
data.isnull().sum()

First Name            67
Gender               145
Start Date             0
Last Login             0
Salary                 0
Bonus                  0
Senior Management      0
Team                  43
dtype: int64

In [44]:
data.dropna(how="all")  # remove row in which all data is none

,First Name,Gender,Start Date,Last Login,Salary,Bonus,Senior Management,Team
0,Douglas,Male,1993-08-06,2024-01-17 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2024-01-17 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2024-01-17 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2024-01-17 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2024-01-17 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
995,Henry,NaN,2014-11-23,2024-01-17 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2024-01-17 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2024-01-17 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2024-01-17 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2024-01-17 18:24:00,129949,10.169,True,Sales

In [47]:
data1 = data.dropna(how="any")  # remove row in which any data is none
data1

,First Name,Gender,Start Date,Last Login,Salary,Bonus,Senior Management,Team
0,Douglas,Male,1993-08-06,2024-01-17 12:42:00,97308,6.945,True,Marketing
2,Maria,Female,1993-04-23,2024-01-17 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2024-01-17 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2024-01-17 16:47:00,101004,1.389,True,Client Services
5,Dennis,Male,1987-04-18,2024-01-17 01:35:00,115163,10.125,False,Legal
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2024-01-17 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2024-01-17 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2024-01-17 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2024-01-17 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2024-01-17 18:24:00,129949,10.169,True,Sales

In [48]:
data1.isnull().sum()

First Name           0
Gender               0
Start Date           0
Last Login           0
Salary               0
Bonus                0
Senior Management    0
Team                 0
dtype: int64

In [51]:
data.dropna(how="any", subset=['Gender'])  # remove row in which  data in Gender column is none

,First Name,Gender,Start Date,Last Login,Salary,Bonus,Senior Management,Team
0,Douglas,Male,1993-08-06,2024-01-17 12:42:00,97308,6.945,True,Marketing
1,Thomas,Male,1996-03-31,2024-01-17 06:53:00,61933,4.170,True,NaN
2,Maria,Female,1993-04-23,2024-01-17 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2024-01-17 13:00:00,138705,9.340,True,Finance
4,Larry,Male,1998-01-24,2024-01-17 16:47:00,101004,1.389,True,Client Services
...,...,...,...,...,...,...,...,...
994,George,Male,2013-06-21,2024-01-17 17:47:00,98874,4.479,True,Marketing
996,Phillip,Male,1984-01-31,2024-01-17 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2024-01-17 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2024-01-17 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2024-01-17 18:24:00,129949,10.169,True,Sales

In [59]:
# to replace null value

data['First Name'] = data['First Name'].fillna("Unknown")
data['Gender'] = data['Gender'].fillna("Unknown")
data['Team'] = data['Team'].fillna("Unknown")

In [60]:
data.isnull().sum()

First Name           0
Gender               0
Start Date           0
Last Login           0
Salary               0
Bonus                0
Senior Management    0
Team                 0
dtype: int64

In [64]:
# to remove a particular column

data2 = data.drop(['Last Login', 'Senior Management'], axis=1)
data2

    First Name   Gender Start Date  Salary   Bonus                  Team
0      Douglas     Male 1993-08-06   97308   6.945             Marketing
1       Thomas     Male 1996-03-31   61933   4.170               Unknown
2        Maria   Female 1993-04-23  130590  11.858               Finance
3        Jerry     Male 2005-03-04  138705   9.340               Finance
4        Larry     Male 1998-01-24  101004   1.389       Client Services
..         ...      ...        ...     ...     ...                   ...
995      Henry  Unknown 2014-11-23  132483  16.655          Distribution
996    Phillip     Male 1984-01-31   42392  19.675               Finance
997    Russell     Male 2013-05-20   96914   1.421               Product
998      Larry     Male 2013-04-20   60500  11.985  Business Development
999     Albert     Male 2012-05-15  129949  10.169                 Sales

[1000 rows x 6 columns]

In [62]:
# to remove a particular row

data3 = data.drop([1,4,6],axis=0)
data3

,First Name,Gender,Start Date,Last Login,Salary,Bonus,Senior Management,Team
0,Douglas,Male,1993-08-06,2024-01-17 12:42:00,97308,6.945,True,Marketing
2,Maria,Female,1993-04-23,2024-01-17 11:17:00,130590,11.858,False,Finance
3,Jerry,Male,2005-03-04,2024-01-17 13:00:00,138705,9.340,True,Finance
5,Dennis,Male,1987-04-18,2024-01-17 01:35:00,115163,10.125,False,Legal
7,Unknown,Female,2015-07-20,2024-01-17 10:43:00,45906,11.598,True,Finance
...,...,...,...,...,...,...,...,...
995,Henry,Unknown,2014-11-23,2024-01-17 06:09:00,132483,16.655,False,Distribution
996,Phillip,Male,1984-01-31,2024-01-17 06:30:00,42392,19.675,False,Finance
997,Russell,Male,2013-05-20,2024-01-17 12:39:00,96914,1.421,False,Product
998,Larry,Male,2013-04-20,2024-01-17 16:45:00,60500,11.985,False,Business Development
999,Albert,Male,2012-05-15,2024-01-17 18:24:00,129949,10.169,True,Sales

In [80]:
# grouping of data

data1.groupby('Gender')[['Salary', 'Bonus']].sum()

          Salary     Bonus
Gender
Female  35266576  3914.525
Male    33824386  3838.578

In [84]:
# slicing dataset

data1.iloc[0:6, 0:3]

  First Name  Gender Start Date
0    Douglas    Male 1993-08-06
2      Maria  Female 1993-04-23
3      Jerry    Male 2005-03-04
4      Larry    Male 1998-01-24
5     Dennis    Male 1987-04-18
6       Ruby  Female 1987-08-17

In [ ]:
# to export data

data1.to_csv()